app/controllers/credit_cards_controller.rb

  def create
    puts "yeah**************************"
    @card  = current_user.build_credit_card(params[:credit_card])
    if @card.save
---
INSERT INTO "credit_cards" ("card_number", "card_type", "created_at", "cvv_number", "expdate_month", "expdate_year", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)