app/controllers/emle_controller.rb

  def index
    @user = User.find(1)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]