app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "day", "email", "first_name", "last_name", "mobile_alias", "mobile_no", "mobile_no_confirmation", "mobile_plan", "month", "name", "network", "password_digest", "phone_manufacturer", "updated_at", "year") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "password_digest" = '$2a$10$tuQSfPzVSlwuBeutDEZM7u/xDcQYi7fmoZK0XDbvmV5W5sgYtk7Dm', "updated_at" = '2012-01-07 22:17:47.779835' WHERE "users"."id" = 1